Revit 2026 API

# GroundConductorSizeSetIteratorReset Method

---

Bring the iterator back to the start of the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual void Reset()
```
```vb
Public Overridable Sub Reset
```
```cpp
public:
virtual void Reset()
```
```fsharp
abstract Reset : unit -> unit
override Reset : unit -> unit
```

#### Implements

IEnumeratorReset

The Reset method will return the iterator back to the start of the set in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

#### Reference

GroundConductorSizeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace